// src/theme/colors.js

export const colors = {
  primary: '#6200EE', // Основной цвет
  primaryDark: '#3700B3', // Темнее основного
  primaryLight: 'rgba(98, 0, 238, 0.2)', // <-- ДОБАВЛЕНО: Светлый/прозрачный вариант основного для ripple
  accent: '#03DAC6', // Акцентный цвет
  background: '#F5F5F5', // Цвет фона для экранов
  surface: '#FFFFFF', // Цвет поверхности для карточек, модальных окон
  text: '#212121', // Основной цвет текста
  placeholder: '#757575', // Цвет текста-заполнителя
  error: '#B00020', // Цвет для ошибок
  onPrimary: '#FFFFFF', // Цвет текста на основном фоне
  onSurface: '#212121', // Цвет текста на поверхности
  onError: '#FFFFFF', // Цвет текста на фоне ошибки
};